Documents/ОперативныйЗакуп.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ОперативныйЗакуп</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПодотчет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПоставщик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НарядЗадания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наряд</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.НарядЗадание</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКупить</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПоставщик</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстаткиНаСкладе</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодЗаказ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Спецификация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СработалРезерв</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаРасшифровки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БазоваяНом</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзготовления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скомплектован</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Спецификация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/РезервныйЗапасМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>РезервныйЗапасМатериалов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НастройкиНоменклатуры</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресХранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейНаИзготовление</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗакупОптом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МожетПредоставитьЗаказчик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкруглятьДоЛистов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнаяПоСкладу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановаяЗакупочная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодЗаказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Розничная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтатусСпецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СтатусСпецификации</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСпецификации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Спецификация</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Комплект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ОперативныйЗакуп/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОБЩЕГО_НАЗНАЧЕНИЯ

&НаКлиенте
Функция ПересчитатьСуммыДокумента(ПодЗаказ)
	
	// { Васильев Александр Леонидович [24.05.2016]
	// Не больше 150 строк в документе.
	// Посмотрим, не будет ли тормозить на клиенте.
	// } Васильев Александр Леонидович [24.05.2016]
	
	Объект.СуммаПодотчет = 0;
	Объект.СуммаПоставщик = 0;
	
	Для каждого Строка Из Объект.СписокНоменклатуры Цикл
		
		Объект.СуммаПодотчет = Объект.СуммаПодотчет + Строка.КоличествоКупить * Строка.Цена;
		Объект.СуммаПоставщик = Объект.СуммаПоставщик + Строка.КоличествоПоставщик * Строка.Цена;
		
	КонецЦикла;
	
	Объект.СуммаДокумента = Объект.СуммаПодотчет + Объект.СуммаПоставщик;
	
КонецФункции

#КонецОбласти

#Область СОБЫТИЯ_ФОРМЫ

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборРасшифровки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаполнитьНаСервере()
	
	Если Объект.Подразделение.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите подразделение",, "Подразделение");
		Возврат;
	КонецЕсли;
	
	Если Объект.СписокНоменклатуры.Количество() > 0 Тогда
		
		Ответ = Вопрос("Данные введенные вручную будут утеряны. Продолжить?", РежимДиалогаВопрос.ДаНет);
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область КОМАНДЫ

&НаКлиенте
Процедура Заполнить(Команда)
	
	ПередЗаполнитьНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ОпределитьКонтрагента()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таб.Поставщик КАК Контрагент
	|ПОМЕСТИТЬ вТаб
	|ИЗ
	|	Документ.ОперативныйЗакуп.СписокНоменклатуры КАК Таб
	|ГДЕ
	|	Таб.КоличествоПоставщик > 0
	|	И Таб.Поставщик <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	И Таб.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Контрагент КАК Контрагент
	|ИЗ
	|	вТаб КАК Т";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Контрагент");
	
КонецФункции

&НаКлиенте
Процедура ПоступлениеМатериаловУслуг(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	Контрагенты = ОпределитьКонтрагента();
	КонтрагентПоступления = Неопределено;
	
	Если Контрагенты.Количество() = 1 Тогда
		
		КонтрагентПоступления = Контрагенты[0];
		
	Иначе
		
		СписокКонтрагентов = Новый СписокЗначений;
		СписокКонтрагентов.ЗагрузитьЗначения(Контрагенты);
		ВыбЭлемент = СписокКонтрагентов.ВыбратьЭлемент("Выберите контрагента");
		Если ВыбЭлемент <> Неопределено Тогда
			КонтрагентПоступления = ВыбЭлемент.Значение;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КонтрагентПоступления) Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Контрагент", КонтрагентПоступления);
		ДополнительныеПараметры.Вставить("Ссылка", Объект.Ссылка);
		
		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("Основание", ДополнительныеПараметры);
		
		ОткрытьФорму("Документ.ПоступлениеМатериаловУслуг.ФормаОбъекта", ДанныеЗаполнения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	Объект.СписокНоменклатуры.Очистить();
	
	#Область Запрос_заполнения_номенклатуры
	
	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		ДеньВыборки = Объект.Дата;
	Иначе
		ДеньВыборки = ТекущаяДата();
	КонецЕсли;
	
	Объект.СуммаДокумента = 0;
	Объект.СуммаПодотчет = 0;
	Объект.СуммаПоставщик = 0;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	Запрос.УстановитьПараметр("ТекущаяДата", ДеньВыборки);
	Запрос.УстановитьПараметр("ОсновнойСклад", Объект.Подразделение.ОсновнойСклад);
	Запрос.УстановитьПараметр("ТекущийДокумент", Объект.Ссылка);
	Запрос.УстановитьПараметр("НарядЗадания", Объект.НарядЗадания.Выгрузить().ВыгрузитьКолонку("Наряд"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписокСпецификаций.Спецификация КАК СпецификацияСсылка
	|ПОМЕСТИТЬ втСпецификации
	|ИЗ
	|	Документ.НарядЗадание.СписокСпецификаций КАК СписокСпецификаций
	|ГДЕ
	|	СписокСпецификаций.Ссылка В(&НарядЗадания)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Список.Номенклатура КАК Номенклатура,
	|	СУММА(Список.КоличествоКупить + Список.КоличествоПоставщик) КАК Количество
	|ПОМЕСТИТЬ втНоменклатураИзДругихОперативныхЗакупов
	|ИЗ
	|	Документ.ОперативныйЗакуп.СписокНоменклатуры КАК Список
	|ГДЕ
	|	Список.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ) И КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	|	И ВЫБОР
	|			КОГДА &ТекущийДокумент <> ЗНАЧЕНИЕ(Документ.ОперативныйЗакуп.ПустаяСсылка)
	|				ТОГДА Список.Ссылка <> &ТекущийДокумент
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И (Список.КоличествоКупить > 0
	|			ИЛИ Список.КоличествоПоставщик > 0)
	|	И Список.Ссылка.Подразделение = &Подразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	Список.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(УправленческийОстатки.Субконто2, НоменклатураИзДругихОперативныхЗакупов.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(УправленческийОстатки.КоличествоРазвернутыйОстатокДт, 0) + ЕСТЬNULL(НоменклатураИзДругихОперативныхЗакупов.Количество, 0) КАК Количество
	|ПОМЕСТИТЬ втОстаткиРегистр
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.Остатки(
	|			&ТекущаяДата,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.МатериалыНаСкладе),
	|			,
	|			Подразделение = &Подразделение
	|				И Субконто1 = &ОсновнойСклад) КАК УправленческийОстатки
	|		ПОЛНОЕ СОЕДИНЕНИЕ втНоменклатураИзДругихОперативныхЗакупов КАК НоменклатураИзДругихОперативныхЗакупов
	|		ПО ((ВЫРАЗИТЬ(УправленческийОстатки.Субконто2 КАК Справочник.Номенклатура)) = НоменклатураИзДругихОперативныхЗакупов.Номенклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА втОстаткиРегистр.Номенклатура.Базовый
	|			ТОГДА втОстаткиРегистр.Номенклатура
	|		ИНАЧЕ втОстаткиРегистр.Номенклатура.БазоваяНоменклатура
	|	КОНЕЦ КАК Номенклатура,
	|	СУММА(ВЫБОР
	|			КОГДА втОстаткиРегистр.Номенклатура.Базовый
	|				ТОГДА втОстаткиРегистр.Количество
	|			ИНАЧЕ втОстаткиРегистр.Количество * втОстаткиРегистр.Номенклатура.КоэффициентБазовых
	|		КОНЕЦ) КАК Количество
	|ПОМЕСТИТЬ втОстаткиНаСкладе
	|ИЗ
	|	втОстаткиРегистр КАК втОстаткиРегистр
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА втОстаткиРегистр.Номенклатура.Базовый
	|			ТОГДА втОстаткиРегистр.Номенклатура
	|		ИНАЧЕ втОстаткиРегистр.Номенклатура.БазоваяНоменклатура
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезервныйЗапас.Номенклатура КАК Номенклатура,
	|	РезервныйЗапас.Количество КАК Количество
	|ПОМЕСТИТЬ втРезервныйЗапас
	|ИЗ
	|	РегистрСведений.РезервныйЗапасМатериалов.СрезПоследних(
	|			&ТекущаяДата,
	|			Подразделение = &Подразделение
	|				И Склад = &ОсновнойСклад) КАК РезервныйЗапас
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРезервныйЗапас.Номенклатура КАК Номенклатура,
	|	втРезервныйЗапас.Количество - ЕСТЬNULL(втОстаткиНаСкладе.Количество, 0) КАК Количество
	|ПОМЕСТИТЬ втДокупитьПоРезерву
	|ИЗ
	|	втРезервныйЗапас КАК втРезервныйЗапас
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиНаСкладе КАК втОстаткиНаСкладе
	|		ПО (втОстаткиНаСкладе.Номенклатура = втРезервныйЗапас.Номенклатура)
	|ГДЕ
	|	ЕСТЬNULL(втОстаткиНаСкладе.Количество, 0) < втРезервныйЗапас.Количество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НарядЗаданиеСписокЛистовНоменклатуры.Номенклатура КАК Номенклатура,
	|	СУММА(НарядЗаданиеСписокЛистовНоменклатуры.Количество * ЕСТЬNULL(НастройкиНоменклатуры.ОсновнаяПоСкладу.КоэффициентБазовых, 1)) КАК Количество
	|ПОМЕСТИТЬ втТребуетсяЛистовогоПоНаряду
	|ИЗ
	|	Документ.НарядЗадание.СписокЛистовНоменклатуры КАК НарядЗаданиеСписокЛистовНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиНоменклатуры.СрезПоследних(&ТекущаяДата, Подразделение = &Подразделение) КАК НастройкиНоменклатуры
	|		ПО НарядЗаданиеСписокЛистовНоменклатуры.Номенклатура = НастройкиНоменклатуры.Номенклатура
	|ГДЕ
	|	НарядЗаданиеСписокЛистовНоменклатуры.Ссылка В(&НарядЗадания)
	|
	|СГРУППИРОВАТЬ ПО
	|	НарядЗаданиеСписокЛистовНоменклатуры.Ссылка.Подразделение,
	|	НарядЗаданиеСписокЛистовНоменклатуры.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпецификацияСписокНоменклатуры.Номенклатура КАК Номенклатура,
	|	СУММА(СпецификацияСписокНоменклатуры.Количество) КАК КоличествоВсегоТребуется
	|ПОМЕСТИТЬ втТребуетсяПоСпецификациям
	|ИЗ
	|	Документ.Спецификация.СписокНоменклатуры КАК СпецификацияСписокНоменклатуры
	|ГДЕ
	|	СпецификацияСписокНоменклатуры.Ссылка В
	|			(ВЫБРАТЬ
	|				т.СпецификацияСсылка
	|			ИЗ
	|				втСпецификации КАК т)
	|	И СпецификацияСписокНоменклатуры.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Материал)
	|	И НЕ СпецификацияСписокНоменклатуры.ПредоставитЗаказчик
	|	И СпецификацияСписокНоменклатуры.Номенклатура.НоменклатурнаяГруппа.ВидМатериала <> ЗНАЧЕНИЕ(Перечисление.ВидыМатериалов.Листовой)
	|
	|СГРУППИРОВАТЬ ПО
	|	СпецификацияСписокНоменклатуры.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТребуетсяПоСпецификациям.Номенклатура КАК Номенклатура,
	|	втТребуетсяПоСпецификациям.КоличествоВсегоТребуется - ЕСТЬNULL(втОстаткиНаСкладе.Количество, 0) КАК Количество
	|ПОМЕСТИТЬ втДокупитьПоСпецификацям
	|ИЗ
	|	втТребуетсяПоСпецификациям КАК втТребуетсяПоСпецификациям
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиНаСкладе КАК втОстаткиНаСкладе
	|		ПО втТребуетсяПоСпецификациям.Номенклатура = втОстаткиНаСкладе.Номенклатура
	|ГДЕ
	|	втТребуетсяПоСпецификациям.КоличествоВсегоТребуется - ЕСТЬNULL(втОстаткиНаСкладе.Количество, 0) > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втТребуетсяЛистовогоПоНаряду.Номенклатура,
	|	втТребуетсяЛистовогоПоНаряду.Количество - ЕСТЬNULL(втОстаткиНаСкладе.Количество, 0)
	|ИЗ
	|	втТребуетсяЛистовогоПоНаряду КАК втТребуетсяЛистовогоПоНаряду
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиНаСкладе КАК втОстаткиНаСкладе
	|		ПО втТребуетсяЛистовогоПоНаряду.Номенклатура = втОстаткиНаСкладе.Номенклатура
	|ГДЕ
	|	втТребуетсяЛистовогоПоНаряду.Количество - ЕСТЬNULL(втОстаткиНаСкладе.Количество, 0) > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(втДокупитьПоРезерву.Номенклатура, втДокупитьПоСпецификацям.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(втДокупитьПоРезерву.Количество, 0) + ЕСТЬNULL(втДокупитьПоСпецификацям.Количество, 0) КАК Количество,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втДокупитьПоРезерву.Количество, 0) > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СработалРезерв
	|ПОМЕСТИТЬ втМатериалыДляЗакупа
	|ИЗ
	|	втДокупитьПоРезерву КАК втДокупитьПоРезерву
	|		ПОЛНОЕ СОЕДИНЕНИЕ втДокупитьПоСпецификацям КАК втДокупитьПоСпецификацям
	|		ПО втДокупитьПоРезерву.Номенклатура = втДокупитьПоСпецификацям.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиНоменклатуры.Поставщик,
	|	ВЫБОР
	|		КОГДА НастройкиНоменклатуры.ОсновнаяПоСкладу ЕСТЬ NULL
	|				ИЛИ НастройкиНоменклатуры.ОсновнаяПоСкладу = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА втМатериалыДляЗакупа.Номенклатура
	|		ИНАЧЕ НастройкиНоменклатуры.ОсновнаяПоСкладу
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫРАЗИТЬ(втМатериалыДляЗакупа.Количество / ВЫБОР
	|			КОГДА ЕСТЬNULL(НастройкиНоменклатуры.ОсновнаяПоСкладу.КоэффициентБазовых, 1) = 0
	|				ТОГДА 1
	|			ИНАЧЕ ЕСТЬNULL(НастройкиНоменклатуры.ОсновнаяПоСкладу.КоэффициентБазовых, 1)
	|		КОНЕЦ + 0.49999 КАК ЧИСЛО(15, 0)) КАК Количество,
	|	втМатериалыДляЗакупа.СработалРезерв,
	|	ЕСТЬNULL(НастройкиНоменклатуры.ПлановаяЗакупочная, 0) * ЕСТЬNULL(НастройкиНоменклатуры.ОсновнаяПоСкладу.КоэффициентБазовых, 1) КАК Цена,
	|	ЛОЖЬ КАК ПодЗаказ
	|ИЗ
	|	втМатериалыДляЗакупа КАК втМатериалыДляЗакупа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиНоменклатуры.СрезПоследних(&ТекущаяДата, Подразделение = &Подразделение) КАК НастройкиНоменклатуры
	|		ПО втМатериалыДляЗакупа.Номенклатура = НастройкиНоменклатуры.Номенклатура
	|ГДЕ
	|	НЕ ЕСТЬNULL(НастройкиНоменклатуры.ПодЗаказ, ИСТИНА)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	НастройкиНоменклатуры.Поставщик";

	
	
	//|;
	//|
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВЫБОР
	//|		КОГДА НастройкиНоменклатуры.ОсновнаяПоСкладу ЕСТЬ NULL
	//|				ИЛИ НастройкиНоменклатуры.ОсновнаяПоСкладу = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	//|			ТОГДА втМатериалыСоСтоимостью.Номенклатура
	//|		ИНАЧЕ НастройкиНоменклатуры.ОсновнаяПоСкладу
	//|	КОНЕЦ КАК Номенклатура,
	//|	втМатериалыСоСтоимостью.Цена,
	//|	втМатериалыСоСтоимостью.Количество,
	//|	втМатериалыСоСтоимостью.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//|	втМатериалыСоСтоимостью.СработалРезерв,
	//|	втМатериалыСоСтоимостью.Поставщик КАК Поставщик,
	//|	ЕСТЬNULL(НастройкиНоменклатуры.ПодЗаказ, ИСТИНА) КАК ПодЗаказ
	//|ИЗ
	//|	втМатериалыСоСтоимостью КАК втМатериалыСоСтоимостью
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиНоменклатуры.СрезПоследних(&ТекущаяДата, Подразделение = &Подразделение) КАК НастройкиНоменклатуры
	//|		ПО (ВЫБОР
	//|				КОГДА втМатериалыСоСтоимостью.Номенклатура.Базовый
	//|					ТОГДА втМатериалыСоСтоимостью.Номенклатура = НастройкиНоменклатуры.Номенклатура
	//|				ИНАЧЕ втМатериалыСоСтоимостью.Номенклатура.БазоваяНоменклатура = НастройкиНоменклатуры.Номенклатура
	//|			КОНЕЦ)
	//|ГДЕ
	//|	НЕ ЕСТЬNULL(НастройкиНоменклатуры.ПодЗаказ, ИСТИНА)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Номенклатура,
	//|	Поставщик";
	
	#КонецОбласти
	
	ТЗНом = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	Запрос.УстановитьПараметр("НарядЗадания", Объект.НарядЗадания.Выгрузить().ВыгрузитьКолонку("Наряд"));
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Спец.Ссылка КАК СпецификацияСсылка
	|ПОМЕСТИТЬ втСпецификации
	|ИЗ
	|	Документ.Спецификация КАК Спец
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НарядЗадание.СписокСпецификаций КАК Наряд
	|		ПО Спец.Ссылка = Наряд.Спецификация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусСпецификации.СрезПоследних КАК СтатусСпец
	|		ПО Спец.Ссылка = СтатусСпец.Спецификация
	|ГДЕ
	|	Наряд.Ссылка В(&НарядЗадания)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НастройкиНоменклатуры.ОсновнаяПоСкладу ЕСТЬ NULL
	|				ИЛИ НастройкиНоменклатуры.ОсновнаяПоСкладу = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА Спец.Номенклатура
	|		ИНАЧЕ НастройкиНоменклатуры.ОсновнаяПоСкладу
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА НастройкиНоменклатуры.ОсновнаяПоСкладу ЕСТЬ NULL
	|						ИЛИ НастройкиНоменклатуры.ОсновнаяПоСкладу = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|					ТОГДА Спец.Номенклатура.КоэффициентБазовых
	|				ИНАЧЕ НастройкиНоменклатуры.ОсновнаяПоСкладу.КоэффициентБазовых
	|			КОНЕЦ = 0
	|			ТОГДА 1
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НастройкиНоменклатуры.ОсновнаяПоСкладу ЕСТЬ NULL
	|						ИЛИ НастройкиНоменклатуры.ОсновнаяПоСкладу = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|					ТОГДА Спец.Номенклатура.КоэффициентБазовых
	|				ИНАЧЕ НастройкиНоменклатуры.ОсновнаяПоСкладу.КоэффициентБазовых
	|			КОНЕЦ
	|	КОНЕЦ КАК Коэффициент,
	|	Спец.Количество,
	|	Спец.Цена,
	|	Спец.Поставщик,
	|	Спец.Ссылка КАК Спецификация,
	|	Спец.Комментарий,
	|	Остатки.Количество КАК ОстаткиНаСкладе
	|ПОМЕСТИТЬ втМатериалы
	|ИЗ
	|	Документ.Спецификация.СписокМатериаловПодЗаказ КАК Спец
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиНоменклатуры.СрезПоследних(&Период, Подразделение = &Подразделение) КАК НастройкиНоменклатуры
	|		ПО Спец.Номенклатура = НастройкиНоменклатуры.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВЫБОР
	|				КОГДА УпрОстатки.Субконто2.Базовый
	|					ТОГДА УпрОстатки.Субконто2
	|				ИНАЧЕ УпрОстатки.Субконто2.БазоваяНоменклатура
	|			КОНЕЦ КАК Номенклатура,
	|			СУММА(ВЫБОР
	|					КОГДА УпрОстатки.Субконто2.Базовый
	|						ТОГДА УпрОстатки.КоличествоОстаток
	|					ИНАЧЕ УпрОстатки.КоличествоОстаток * УпрОстатки.Субконто2.КоэффициентБазовых
	|				КОНЕЦ) КАК Количество
	|		ИЗ
	|			РегистрБухгалтерии.Управленческий.Остатки(
	|					&Период,
	|					Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.МатериалыНаСкладе),
	|					,
	|					Субконто1.ОсновнойСклад = ИСТИНА
	|						И Подразделение = &Подразделение) КАК УпрОстатки
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВЫБОР
	|				КОГДА УпрОстатки.Субконто2.Базовый
	|					ТОГДА УпрОстатки.Субконто2
	|				ИНАЧЕ УпрОстатки.Субконто2.БазоваяНоменклатура
	|			КОНЕЦ) КАК Остатки
	|		ПО Спец.Номенклатура = Остатки.Номенклатура
	|ГДЕ
	|	Спец.Ссылка В
	|			(ВЫБРАТЬ
	|				т.СпецификацияСсылка
	|			ИЗ
	|				втСпецификации КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Материалы.Номенклатура КАК Номенклатура,
	|	Материалы.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВЫРАЗИТЬ(Материалы.Количество / Материалы.Коэффициент + 0.4999 КАК ЧИСЛО(15, 0)) КАК Количество,
	|	ВЫРАЗИТЬ(Материалы.Цена * Материалы.Коэффициент КАК ЧИСЛО(15, 0)) КАК Цена,
	|	Материалы.Поставщик КАК Поставщик,
	|	Материалы.Спецификация КАК Спецификация,
	|	Материалы.Комментарий КАК Комментарий,
	|	Материалы.ОстаткиНаСкладе / Материалы.Коэффициент КАК ОстаткиНаСкладе,
	|	ИСТИНА КАК ПодЗаказ
	|ИЗ
	|	втМатериалы КАК Материалы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Материалы.Номенклатура.Наименование";
	
	ТЗНомПодЗаказ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр ИЗ ТЗНом Цикл
		
		НоваяСтрока = Объект.СписокНоменклатуры.Добавить();
		НоваяСтрока.Номенклатура = Стр.Номенклатура;
		НоваяСтрока.Цена = Стр.Цена;
		НоваяСтрока.Количество = Стр.Количество;
		НоваяСтрока.СработалРезерв = Стр.СработалРезерв;
		НоваяСтрока.Поставщик = Стр.Поставщик;
		НоваяСтрока.ПодЗаказ = Ложь;
		
	КонецЦикла;
	
	Для Каждого Стр ИЗ ТЗНомПодЗаказ Цикл
		
		НоваяСтрока = Объект.СписокНоменклатуры.Добавить();
		НоваяСтрока.Номенклатура = Стр.Номенклатура;
		НоваяСтрока.Цена = Стр.Цена;
		НоваяСтрока.Количество = Стр.Количество;
		НоваяСтрока.Поставщик = Стр.Поставщик;
		НоваяСтрока.Спецификация = Стр.Спецификация;
		НоваяСтрока.Комментарий = Стр.Комментарий;
		НоваяСтрока.ОстаткиНаСкладе = Стр.ОстаткиНаСкладе;
		НоваяСтрока.ПодЗаказ = Истина;
		
	КонецЦикла;
	
	ПолучитьРасшифровку();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьНаряды(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Подразделение", Объект.Подразделение);
	ПараметрыФормы.Вставить("ТЗ", Объект.НарядЗадания);
	
	АдресТаблицы = ОткрытьФормуМодально("ОбщаяФорма.ФормаВыбораНаряда", ПараметрыФормы, ЭтаФорма);
	
	Если АдресТаблицы <> Неопределено Тогда
		ЗагрузитьНаряды(АдресТаблицы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаряды(АдресТаблицы)
	
	Если ЭтоАдресВременногоХранилища(АдресТаблицы) Тогда
		ТЗ = ПолучитьИзВременногоХранилища(АдресТаблицы);
		Объект.НарядЗадания.Загрузить(ТЗ);
		ЗаполнитьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СОБЫТИЯ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ПередЗаполнитьНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ТАБЛИЦА_СПИСОК_НОМЕНКЛАТУРЫ

&НаКлиенте
Процедура СписокНоменклатурыПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборРасшифровки();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	//RonEXI: Разрешить добавление руками. Лайн Д.В 18 апреля 2016
	//Отказ = Истина;
	Заглушка = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПодЗаказПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПодЗаказПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыКоличествоКупитьПриИзменении(Элемент)
	
	ПересчитатьСуммыДокумента(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыКоличествоПоставщикПриИзменении(Элемент)
	
	ПересчитатьСуммыДокумента(Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСвойстваНоменклатуры(фнНоменклатура, фнПодразделение)
	
	Если НЕ фнНоменклатура.Базовый Тогда
		ОтборНоменклатура = фнНоменклатура.БазоваяНоменклатура;
	Иначе
		ОтборНоменклатура = фнНоменклатура;
	КонецЕсли;
	
	КоэффициентДляУмноженияЦены = ?(фнНоменклатура.КоэффициентБазовых <> 0, фнНоменклатура.КоэффициентБазовых, 1);
	Свойства = Новый Структура;
	Свойства.Вставить("ПлановаяЦена", 0);
	Свойства.Вставить("ЕдиницаИзмерения", ОтборНоменклатура.ЕдиницаИзмерения);
	Свойства.Вставить("Поставщик");
	Свойства.Вставить("КоличествоОстаток");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", ОтборНоменклатура);
	Запрос.УстановитьПараметр("Подразделение", фнПодразделение);
	Запрос.УстановитьПараметр("ОсновнойСклад" , ОбщегоНазначения.ЗначениеРеквизитаОбъекта(фнПодразделение, "ОсновнойСклад"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦеныНоменклатуры.ПлановаяЗакупочная,
	|	ЦеныНоменклатуры.Поставщик,
	|	ЕСТЬNULL(УправленческийОстатки.КоличествоРазвернутыйОстатокДт, 0) КАК КоличествоОстаток
	|ИЗ
	|	РегистрСведений.НастройкиНоменклатуры.СрезПоследних(
	|			,
	|			Подразделение = &Подразделение
	|				И Номенклатура = &Номенклатура) КАК ЦеныНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.Остатки(
	|				,
	|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.МатериалыНаСкладе),
	|				,
	|				Подразделение = &Подразделение
	|					И Субконто1 = &ОсновнойСклад) КАК УправленческийОстатки
	|		ПО ЦеныНоменклатуры.Номенклатура = УправленческийОстатки.Субконто2";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Свойства.ПлановаяЦена = Выборка.ПлановаяЗакупочная*КоэффициентДляУмноженияЦены;
		Свойства.Поставщик = Выборка.Поставщик;
		Свойства.КоличествоОстаток = Выборка.КоличествоОстаток;
		
	КонецЦикла;
	
	Возврат Свойства;
	
КонецФункции

#КонецОбласти

#Область ТАБЛИЦА_РАСШИФРОВКА

&НаКлиенте
Процедура ТаблицаРасшифровкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьЗначение(Элементы.ТаблицаРасшифровки.ТекущиеДанные.Спецификация);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьРасшифровку()
	
	Если Объект.Подразделение.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	Запрос.УстановитьПараметр("НарядЗадания", Объект.НарядЗадания.Выгрузить().ВыгрузитьКолонку("Наряд"));
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Спец.Ссылка КАК СпецификацияСсылка
	|ПОМЕСТИТЬ втСпецификации
	|ИЗ
	|	Документ.Спецификация КАК Спец
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НарядЗадание.СписокСпецификаций КАК Наряд
	|		ПО Спец.Ссылка = Наряд.Спецификация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусСпецификации.СрезПоследних КАК СтатусСпец
	|		ПО Спец.Ссылка = СтатусСпец.Спецификация
	|ГДЕ
	|	Наряд.Ссылка В(&НарядЗадания)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпецификацияСписокНоменклатуры.Номенклатура КАК Номенклатура,
	|	СУММА(СпецификацияСписокНоменклатуры.Количество) КАК Количество,
	|	СпецификацияСписокНоменклатуры.Ссылка,
	|	СпецификацияСписокНоменклатуры.Ссылка.ДатаИзготовления,
	|	ВЫБОР
	|		КОГДА Комплектация.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Скомплектован
	|ПОМЕСТИТЬ Список
	|ИЗ
	|	Документ.Спецификация.СписокНоменклатуры КАК СпецификацияСписокНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Комплектация КАК Комплектация
	|		ПО СпецификацияСписокНоменклатуры.Ссылка = Комплектация.Спецификация
	|ГДЕ
	|	СпецификацияСписокНоменклатуры.Ссылка В
	|			(ВЫБРАТЬ
	|				т.СпецификацияСсылка
	|			ИЗ
	|				втСпецификации КАК т)
	|	И СпецификацияСписокНоменклатуры.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Материал)
	|
	|СГРУППИРОВАТЬ ПО
	|	СпецификацияСписокНоменклатуры.Номенклатура,
	|	СпецификацияСписокНоменклатуры.Ссылка,
	|	ВЫБОР
	|		КОГДА Комплектация.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	СпецификацияСписокНоменклатуры.Ссылка.ДатаИзготовления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НастройкиНоменклатуры.ОсновнаяПоСкладу ЕСТЬ NULL
	|				ИЛИ НастройкиНоменклатуры.ОсновнаяПоСкладу = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА Список.Номенклатура
	|		ИНАЧЕ НастройкиНоменклатуры.ОсновнаяПоСкладу
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА Список.Номенклатура.Базовый
	|			ТОГДА Список.Номенклатура
	|		ИНАЧЕ Список.Номенклатура.БазоваяНоменклатура
	|	КОНЕЦ КАК БазоваяНом,
	|	Список.Количество,
	|	Список.Ссылка КАК Спецификация,
	|	Список.ДатаИзготовления,
	|	Список.Скомплектован
	|ПОМЕСТИТЬ Список2
	|ИЗ
	|	Список КАК Список
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиНоменклатуры.СрезПоследних(&Период, Подразделение = &Подразделение) КАК НастройкиНоменклатуры
	|		ПО Список.Номенклатура = НастройкиНоменклатуры.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Список2.Номенклатура,
	|	Список2.БазоваяНом,
	|	Список2.Количество,
	|	Список2.Спецификация,
	|	Список2.ДатаИзготовления,
	|	Список2.Скомплектован,
	|	МатПодЗаказ.Комментарий КАК Комментарий
	|ИЗ
	|	Список2 КАК Список2
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Спецификация.СписокМатериаловПодЗаказ КАК МатПодЗаказ
	|		ПО (Список2.Номенклатура = МатПодЗаказ.Номенклатура
	|				ИЛИ Список2.БазоваяНом = МатПодЗаказ.Номенклатура)
	|			И Список2.Спецификация = МатПодЗаказ.Ссылка";
	
	Результат = Запрос.Выполнить();
	Объект.ТаблицаРасшифровки.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборРасшифровки()
	
	Данные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	
	Если Данные <> Неопределено и ЗначениеЗаполнено(Данные.Номенклатура) Тогда
		
		ПодЗаказ = Данные.ПодЗаказ;
		
		НомДанные = ЛексСервер.ЗначенияРеквизитовОбъекта(Данные.Номенклатура, "Базовый, БазоваяНоменклатура");
		НомСсылка = Данные.Номенклатура;
		
		Если НЕ НомДанные.Базовый Тогда
			НомСсылка = НомДанные.БазоваяНоменклатура;
		Иначе
			
		КонецЕсли;
		
		Если ПодЗаказ Тогда
			ОтборСтрок = Новый ФиксированнаяСтруктура("Спецификация, БазоваяНом", Данные.Спецификация, НомСсылка);
		Иначе
			ОтборСтрок = Новый ФиксированнаяСтруктура("БазоваяНом", НомСсылка);
		КонецЕсли;
		
	Иначе
		
		ОтборСтрок = Новый ФиксированнаяСтруктура("Номенклатура", ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
		
	КонецЕсли;
	
	Элементы.ТаблицаРасшифровки.ОтборСтрок = ОтборСтрок;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаТаблицыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	УстановитьОтборРасшифровки();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено
		И ЗначениеЗаполнено(Объект.Подразделение)
		И ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		
		СвойстваНоменклатуры = ПолучитьСвойстваНоменклатуры(ТекущиеДанные.Номенклатура, Объект.Подразделение);
		ТекущиеДанные.Цена = СвойстваНоменклатуры.ПлановаяЦена;
		ТекущиеДанные.Поставщик = СвойстваНоменклатуры.Поставщик;
		ТекущиеДанные.ОстаткиНаСкладе = СвойстваНоменклатуры.КоличествоОстаток;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
